iNavFlight/inav/lib/main/ChibiOS/community/os/hal/ports/STM32/LLD/USBHv1/hal_stm32_otg.h
/**
 * @name HCFG register bit definitions
 * @{
 */
#define HCFG_FSLSS              (1U<<2)     /**< FS- and LS-only support.   */
#define HCFG_FSLSPCS_MASK       (3U<<0)     /**< FS/LS PHY clock select
                                                 mask.                      */
#define HCFG_FSLSPCS_48         (1U<<0)     /**< PHY clock is running at
                                                 48 MHz.                    */
#define HCFG_FSLSPCS_6          (2U<<0)     /**< PHY clock is running at
                                                 6 MHz.                     */
/** @} */

/**
 * @name HFIR register bit definitions
 * @{
 */
#define HFIR_FRIVL_MASK         (0xFFFFU<<0)/**< Frame interval mask.       */
#define HFIR_FRIVL(n)           ((n)<<0)    /**< Frame interval value.      */
/** @} */

/**
 * @name HFNUM register bit definitions
 * @{
 */
#define HFNUM_FTREM_MASK        (0xFFFFU<<16)/**< Frame time Remaining mask.*/
#define HFNUM_FTREM(n)          ((n)<<16)   /**< Frame time Remaining value.*/
#define HFNUM_FRNUM_MASK        (0xFFFFU<<0)/**< Frame number mask.         */
#define HFNUM_FRNUM(n)          ((n)<<0)    /**< Frame number value.        */
/** @} */

/**
 * @name HPTXSTS register bit definitions
 * @{
 */
#define HPTXSTS_PTXQTOP_MASK    (0xFFU<<24) /**< Top of the periodic
                                                 transmit request queue
                                                 mask.                      */
#define HPTXSTS_PTXQTOP(n)      ((n)<<24)   /**< Top of the periodic
                                                 transmit request queue
                                                 value.                     */
#define HPTXSTS_PTXQSAV_MASK    (0xFF<<16)  /**< Periodic transmit request
                                                 queue Space Available
                                                 mask.                      */
#define HPTXSTS_PTXQSAV(n)      ((n)<<16)   /**< Periodic transmit request
                                                 queue Space Available
                                                 value.                     */
#define HPTXSTS_PTXFSAVL_MASK   (0xFFFF<<0) /**< Periodic transmit Data
                                                 FIFO Space Available
                                                 mask.                      */
#define HPTXSTS_PTXFSAVL(n)     ((n)<<0)    /**< Periodic transmit Data
                                                 FIFO Space Available
                                                 value.                     */
/** @} */

/**
 * @name HAINT register bit definitions
 * @{
 */
#define HAINT_HAINT_MASK        (0xFFFFU<<0)/**< Channel interrupts mask.   */
#define HAINT_HAINT(n)          ((n)<<0)    /**< Channel interrupts value.  */
/** @} */

/**
 * @name HAINTMSK register bit definitions
 * @{
 */
#define HAINTMSK_HAINTM_MASK    (0xFFFFU<<0)/**< Channel interrupt mask
                                                 mask.                      */
#define HAINTMSK_HAINTM(n)      ((n)<<0)    /**< Channel interrupt mask
                                                 value.                     */
/** @} */

/**
 * @name HPRT register bit definitions
 * @{
 */
#define HPRT_PSPD_MASK          (3U<<17)    /**< Port speed mask.           */
#define HPRT_PSPD_FS            (1U<<17)    /**< Full speed value.          */
#define HPRT_PSPD_LS            (2U<<17)    /**< Low speed value.           */
#define HPRT_PTCTL_MASK         (15<<13)    /**< Port Test control mask.    */
#define HPRT_PTCTL(n)           ((n)<<13)   /**< Port Test control value.   */
#define HPRT_PPWR               (1U<<12)    /**< Port power.                */
#define HPRT_PLSTS_MASK         (3U<<11)    /**< Port Line status mask.     */
#define HPRT_PLSTS_DM           (1U<<11)    /**< Logic level of D-.         */
#define HPRT_PLSTS_DP           (1U<<10)    /**< Logic level of D+.         */
#define HPRT_PRST               (1U<<8)     /**< Port reset.                */
#define HPRT_PSUSP              (1U<<7)     /**< Port suspend.              */
#define HPRT_PRES               (1U<<6)     /**< Port Resume.               */
#define HPRT_POCCHNG            (1U<<5)     /**< Port overcurrent change.   */
#define HPRT_POCA               (1U<<4)     /**< Port overcurrent active.   */
#define HPRT_PENCHNG            (1U<<3)     /**< Port enable/disable change.*/
#define HPRT_PENA               (1U<<2)     /**< Port enable.               */
#define HPRT_PCDET              (1U<<1)     /**< Port Connect detected.     */
#define HPRT_PCSTS              (1U<<0)     /**< Port connect status.       */
/** @} */

/**
 * @name HCCHAR register bit definitions
 * @{
 */
#define HCCHAR_CHENA            (1U<<31)    /**< Channel enable.            */
#define HCCHAR_CHDIS            (1U<<30)    /**< Channel Disable.           */
#define HCCHAR_ODDFRM           (1U<<29)    /**< Odd frame.                 */
#define HCCHAR_DAD_MASK         (0x7FU<<22) /**< Device Address mask.       */
#define HCCHAR_DAD(n)           ((n)<<22)   /**< Device Address value.      */
#define HCCHAR_MCNT_MASK        (3U<<20)    /**< Multicount mask.           */
#define HCCHAR_MCNT(n)          ((n)<<20)   /**< Multicount value.          */
#define HCCHAR_EPTYP_MASK       (3U<<18)    /**< Endpoint type mask.        */
#define HCCHAR_EPTYP(n)         ((n)<<18)   /**< Endpoint type value.       */
#define HCCHAR_EPTYP_CTL        (0U<<18)    /**< Control endpoint value.    */
#define HCCHAR_EPTYP_ISO        (1U<<18)    /**< Isochronous endpoint value.*/
#define HCCHAR_EPTYP_BULK       (2U<<18)    /**< Bulk endpoint value.       */
#define HCCHAR_EPTYP_INTR       (3U<<18)    /**< Interrupt endpoint value.  */
#define HCCHAR_LSDEV            (1U<<17)    /**< Low-Speed device.          */
#define HCCHAR_EPDIR            (1U<<15)    /**< Endpoint direction.        */
#define HCCHAR_EPNUM_MASK       (15U<<11)   /**< Endpoint number mask.      */
#define HCCHAR_EPNUM(n)         ((n)<<11)   /**< Endpoint number value.     */
#define HCCHAR_MPS_MASK         (0x7FFU<<0)    /**< Maximum packet size mask.  */
#define HCCHAR_MPS(n)           ((n)<<0)    /**< Maximum packet size value. */
/** @} */

/**
 * @name HCINT register bit definitions
 * @{
 */
#define HCINT_DTERR             (1U<<10)    /**< Data toggle error.         */
#define HCINT_FRMOR             (1U<<9)     /**< Frame overrun.             */
#define HCINT_BBERR             (1U<<8)     /**< Babble error.              */
#define HCINT_TRERR             (1U<<7)     /**< Transaction Error.         */
#define HCINT_ACK               (1U<<5)     /**< ACK response
                                                 received/transmitted
                                                 interrupt.                 */
#define HCINT_NAK               (1U<<4)     /**< NAK response received
                                                 interrupt.                 */
#define HCINT_STALL             (1U<<3)     /**< STALL response received
                                                 interrupt.                 */
#define HCINT_CHH               (1U<<1)     /**< Channel halted.            */
#define HCINT_XFRC              (1U<<0)     /**< Transfer completed.        */
/** @} */

/**
 * @name HCINTMSK register bit definitions
 * @{
 */
#define HCINTMSK_DTERRM         (1U<<10)    /**< Data toggle error mask.    */
#define HCINTMSK_FRMORM         (1U<<9)     /**< Frame overrun mask.        */
#define HCINTMSK_BBERRM         (1U<<8)     /**< Babble error mask.         */
#define HCINTMSK_TRERRM         (1U<<7)     /**< Transaction error mask.    */
#define HCINTMSK_NYET           (1U<<6)     /**< NYET response received
                                                 interrupt mask.            */
#define HCINTMSK_ACKM           (1U<<5)     /**< ACK Response
                                                 received/transmitted
                                                 interrupt mask.            */
#define HCINTMSK_NAKM           (1U<<4)     /**< NAK response received
                                                 interrupt mask.            */
#define HCINTMSK_STALLM         (1U<<3)     /**< STALL response received
                                                 interrupt mask.            */
#define HCINTMSK_AHBERRM        (1U<<2)
#define HCINTMSK_CHHM           (1U<<1)     /**< Channel halted mask.       */
#define HCINTMSK_XFRCM          (1U<<0)     /**< Transfer completed mask.   */
/** @} */

/**
 * @name HCTSIZ register bit definitions
 * @{
 */
#define HCTSIZ_DPID_MASK        (3U<<29)    /**< PID mask.                  */
#define HCTSIZ_DPID_DATA0       (0U<<29)    /**< DATA0.                     */
#define HCTSIZ_DPID_DATA2       (1U<<29)    /**< DATA2.                     */
#define HCTSIZ_DPID_DATA1       (2U<<29)    /**< DATA1.                     */
#define HCTSIZ_DPID_MDATA       (3U<<29)    /**< MDATA.                     */
#define HCTSIZ_DPID_SETUP       (3U<<29)    /**< SETUP.                     */
#define HCTSIZ_PKTCNT_MASK      (0x3FFU<<19)/**< Packet count mask.         */
#define HCTSIZ_PKTCNT(n)        ((n)<<19)   /**< Packet count value.        */
#define HCTSIZ_XFRSIZ_MASK      (0x7FFFF<<0)/**< Transfer size mask.        */
#define HCTSIZ_XFRSIZ(n)        ((n)<<0)    /**< Transfer size value.       */
/** @} */

/**
 * @name DCFG register bit definitions
 * @{
 */
#define DCFG_PFIVL_MASK         (3U<<11)    /**< Periodic frame interval
                                                 mask.                      */
#define DCFG_PFIVL(n)           ((n)<<11)   /**< Periodic frame interval
                                                 value.                     */
#define DCFG_DAD_MASK           (0x7FU<<4)  /**< Device address mask.       */
#define DCFG_DAD(n)             ((n)<<4)    /**< Device address value.      */
#define DCFG_NZLSOHSK           (1U<<2)     /**< Non-Zero-Length status
                                                 OUT handshake.             */
#define DCFG_DSPD_MASK          (3U<<0)     /**< Device speed mask.         */
#define DCFG_DSPD_HS            (0U<<0)     /**< High speed (USB 2.0).      */
#define DCFG_DSPD_HS_FS         (1U<<0)     /**< High speed (USB 2.0) in FS
                                                 mode.                      */
#define DCFG_DSPD_FS11          (3U<<0)     /**< Full speed (USB 1.1
                                                 transceiver clock is 48
                                                 MHz).                      */
/** @} */

/**
 * @name DCTL register bit definitions
 * @{
 */
#define DCTL_POPRGDNE           (1U<<11)    /**< Power-on programming done. */
#define DCTL_CGONAK             (1U<<10)    /**< Clear global OUT NAK.      */
#define DCTL_SGONAK             (1U<<9)     /**< Set global OUT NAK.        */
#define DCTL_CGINAK             (1U<<8)     /**< Clear global non-periodic
                                                 IN NAK.                    */
#define DCTL_SGINAK             (1U<<7)     /**< Set global non-periodic
                                                 IN NAK.                    */
#define DCTL_TCTL_MASK          (7U<<4)     /**< Test control mask.         */
#define DCTL_TCTL(n)            ((n)<<4     /**< Test control value.        */
#define DCTL_GONSTS             (1U<<3)     /**< Global OUT NAK status.     */
#define DCTL_GINSTS             (1U<<2)     /**< Global non-periodic IN
                                                 NAK status.                */
#define DCTL_SDIS               (1U<<1)     /**< Soft disconnect.           */
#define DCTL_RWUSIG             (1U<<0)     /**< Remote wakeup signaling.   */
/** @} */

/**
 * @name DSTS register bit definitions
 * @{
 */
#define DSTS_FNSOF_MASK         (0x3FFU<<8) /**< Frame number of the received
                                                 SOF mask.                  */
#define DSTS_FNSOF(n)           ((n)<<8)    /**< Frame number of the received
                                                 SOF value.                 */
#define DSTS_FNSOF_ODD          (1U<<8)     /**< Frame parity of the received
                                                 SOF value.                 */
#define DSTS_EERR               (1U<<3)     /**< Erratic error.             */
#define DSTS_ENUMSPD_MASK       (3U<<1)     /**< Enumerated speed mask.     */
#define DSTS_ENUMSPD_FS_48      (3U<<1)     /**< Full speed (PHY clock is
                                                 running at 48 MHz).        */
#define DSTS_ENUMSPD_HS_480     (0U<<1)     /**< High speed.                */
#define DSTS_SUSPSTS            (1U<<0)     /**< Suspend status.            */
/** @} */

/**
 * @name DIEPMSK register bit definitions
 * @{
 */
#define DIEPMSK_TXFEM           (1U<<6)     /**< Transmit FIFO empty mask.  */
#define DIEPMSK_INEPNEM         (1U<<6)     /**< IN endpoint NAK effective
                                                 mask.                      */
#define DIEPMSK_ITTXFEMSK       (1U<<4)     /**< IN token received when
                                                 TxFIFO empty mask.         */
#define DIEPMSK_TOCM            (1U<<3)     /**< Timeout condition mask.    */
#define DIEPMSK_EPDM            (1U<<1)     /**< Endpoint disabled
                                                 interrupt mask.            */
#define DIEPMSK_XFRCM           (1U<<0)     /**< Transfer completed
                                                 interrupt mask.            */
/** @} */

/**
 * @name DOEPMSK register bit definitions
 * @{
 */
#define DOEPMSK_OTEPDM          (1U<<4)     /**< OUT token received when
                                                 endpoint disabled mask.    */
#define DOEPMSK_STUPM           (1U<<3)     /**< SETUP phase done mask.     */
#define DOEPMSK_EPDM            (1U<<1)     /**< Endpoint disabled
                                                 interrupt mask.            */
#define DOEPMSK_XFRCM           (1U<<0)     /**< Transfer completed
                                                 interrupt mask.            */
/** @} */

/**
 * @name DAINT register bit definitions
 * @{
 */
#define DAINT_OEPINT_MASK       (0xFFFFU<<16)/**< OUT endpoint interrupt
                                                 bits mask.                 */
#define DAINT_OEPINT(n)         ((n)<<16)   /**< OUT endpoint interrupt
                                                 bits value.                */
#define DAINT_IEPINT_MASK       (0xFFFFU<<0)/**< IN endpoint interrupt
                                                 bits mask.                 */
#define DAINT_IEPINT(n)         ((n)<<0)    /**< IN endpoint interrupt
                                                 bits value.                */
/** @} */

/**
 * @name DAINTMSK register bit definitions
 * @{
 */
#define DAINTMSK_OEPM_MASK      (0xFFFFU<<16)/**< OUT EP interrupt mask
                                                 bits mask.                 */
#define DAINTMSK_OEPM(n)        (1U<<(16+(n)))/**< OUT EP interrupt mask
                                                 bits value.                */
#define DAINTMSK_IEPM_MASK      (0xFFFFU<<0)/**< IN EP interrupt mask
                                                 bits mask.                 */
#define DAINTMSK_IEPM(n)        (1U<<(n))   /**< IN EP interrupt mask
                                                 bits value.                */
/** @} */

/**
 * @name DVBUSDIS register bit definitions
 * @{
 */
#define DVBUSDIS_VBUSDT_MASK    (0xFFFFU<<0)/**< Device VBUS discharge
                                                 time mask.                 */
#define DVBUSDIS_VBUSDT(n)      ((n)<<0)    /**< Device VBUS discharge
                                                 time value.                */
/** @} */

/**
 * @name DVBUSPULSE register bit definitions
 * @{
 */
#define DVBUSPULSE_DVBUSP_MASK  (0xFFFU<<0) /**< Device VBUSpulsing time
                                                 mask.                      */
#define DVBUSPULSE_DVBUSP(n)    ((n)<<0)    /**< Device VBUS pulsing time
                                                 value.                     */
/** @} */

/**
 * @name DIEPEMPMSK register bit definitions
 * @{
 */
#define DIEPEMPMSK_INEPTXFEM(n) (1U<<(n))   /**< IN EP Tx FIFO empty
                                                 interrupt mask bit.        */
/** @} */

/**
 * @name DIEPCTL register bit definitions
 * @{
 */
#define DIEPCTL_EPENA           (1U<<31)    /**< Endpoint enable.           */
#define DIEPCTL_EPDIS           (1U<<30)    /**< Endpoint disable.          */
#define DIEPCTL_SD1PID          (1U<<29)    /**< Set DATA1 PID.             */
#define DIEPCTL_SODDFRM         (1U<<29)    /**< Set odd frame.             */
#define DIEPCTL_SD0PID          (1U<<28)    /**< Set DATA0 PID.             */
#define DIEPCTL_SEVNFRM         (1U<<28)    /**< Set even frame.            */
#define DIEPCTL_SNAK            (1U<<27)    /**< Set NAK.                   */
#define DIEPCTL_CNAK            (1U<<26)    /**< Clear NAK.                 */
#define DIEPCTL_TXFNUM_MASK     (15U<<22)   /**< TxFIFO number mask.        */
#define DIEPCTL_TXFNUM(n)       ((n)<<22)   /**< TxFIFO number value.       */
#define DIEPCTL_STALL           (1U<<21)    /**< STALL handshake.           */
#define DIEPCTL_SNPM            (1U<<20)    /**< Snoop mode.                */
#define DIEPCTL_EPTYP_MASK      (3<<18)     /**< Endpoint type mask.        */
#define DIEPCTL_EPTYP_CTRL      (0U<<18)    /**< Control.                   */
#define DIEPCTL_EPTYP_ISO       (1U<<18)    /**< Isochronous.               */
#define DIEPCTL_EPTYP_BULK      (2U<<18)    /**< Bulk.                      */
#define DIEPCTL_EPTYP_INTR      (3U<<18)    /**< Interrupt.                 */
#define DIEPCTL_NAKSTS          (1U<<17)    /**< NAK status.                */
#define DIEPCTL_EONUM           (1U<<16)    /**< Even/odd frame.            */
#define DIEPCTL_DPID            (1U<<16)    /**< Endpoint data PID.         */
#define DIEPCTL_USBAEP          (1U<<15)    /**< USB active endpoint.       */
#define DIEPCTL_MPSIZ_MASK      (0x3FFU<<0) /**< Maximum Packet size mask.  */
#define DIEPCTL_MPSIZ(n)        ((n)<<0)    /**< Maximum Packet size value. */
/** @} */

/**
 * @name DIEPINT register bit definitions
 * @{
 */
#define DIEPINT_TXFE            (1U<<7)     /**< Transmit FIFO empty.       */
#define DIEPINT_INEPNE          (1U<<6)     /**< IN endpoint NAK effective. */
#define DIEPINT_ITTXFE          (1U<<4)     /**< IN Token received when
                                                 TxFIFO is empty.           */
#define DIEPINT_TOC             (1U<<3)     /**< Timeout condition.         */
#define DIEPINT_EPDISD          (1U<<1)     /**< Endpoint disabled
                                                 interrupt.                 */
#define DIEPINT_XFRC            (1U<<0)     /**< Transfer completed.        */
/** @} */

/**
 * @name DIEPTSIZ register bit definitions
 * @{
 */
#define DIEPTSIZ_MCNT_MASK      (3U<<29)    /**< Multi count mask.          */
#define DIEPTSIZ_MCNT(n)        ((n)<<29)   /**< Multi count value.         */
#define DIEPTSIZ_PKTCNT_MASK    (0x3FF<<19) /**< Packet count mask.         */
#define DIEPTSIZ_PKTCNT(n)      ((n)<<19)   /**< Packet count value.        */
#define DIEPTSIZ_XFRSIZ_MASK    (0x7FFFFU<<0)/**< Transfer size mask.       */
#define DIEPTSIZ_XFRSIZ(n)      ((n)<<0)    /**< Transfer size value.       */
/** @} */

/**
 * @name DTXFSTS register bit definitions.
 * @{
 */
#define DTXFSTS_INEPTFSAV_MASK  (0xFFFF<<0) /**< IN endpoint TxFIFO space
                                                 available.                 */
/** @} */

/**
 * @name DOEPCTL register bit definitions.
 * @{
 */
#define DOEPCTL_EPENA           (1U<<31)    /**< Endpoint enable.           */
#define DOEPCTL_EPDIS           (1U<<30)    /**< Endpoint disable.          */
#define DOEPCTL_SD1PID          (1U<<29)    /**< Set DATA1 PID.             */
#define DOEPCTL_SODDFRM         (1U<<29)    /**< Set odd frame.             */
#define DOEPCTL_SD0PID          (1U<<28)    /**< Set DATA0 PID.             */
#define DOEPCTL_SEVNFRM         (1U<<28)    /**< Set even frame.            */
#define DOEPCTL_SNAK            (1U<<27)    /**< Set NAK.                   */
#define DOEPCTL_CNAK            (1U<<26)    /**< Clear NAK.                 */
#define DOEPCTL_STALL           (1U<<21)    /**< STALL handshake.           */
#define DOEPCTL_SNPM            (1U<<20)    /**< Snoop mode.                */
#define DOEPCTL_EPTYP_MASK      (3U<<18)    /**< Endpoint type mask.        */
#define DOEPCTL_EPTYP_CTRL      (0U<<18)    /**< Control.                   */
#define DOEPCTL_EPTYP_ISO       (1U<<18)    /**< Isochronous.               */
#define DOEPCTL_EPTYP_BULK      (2U<<18)    /**< Bulk.                      */
#define DOEPCTL_EPTYP_INTR      (3U<<18)    /**< Interrupt.                 */
#define DOEPCTL_NAKSTS          (1U<<17)    /**< NAK status.                */
#define DOEPCTL_EONUM           (1U<<16)    /**< Even/odd frame.            */
#define DOEPCTL_DPID            (1U<<16)    /**< Endpoint data PID.         */
#define DOEPCTL_USBAEP          (1U<<15)    /**< USB active endpoint.       */
#define DOEPCTL_MPSIZ_MASK      (0x3FFU<<0) /**< Maximum Packet size mask.  */
#define DOEPCTL_MPSIZ(n)        ((n)<<0)    /**< Maximum Packet size value. */
/** @} */

/**
 * @name DOEPINT register bit definitions
 * @{
 */
#define DOEPINT_B2BSTUP         (1U<<6)     /**< Back-to-back SETUP packets
                                                 received.                  */
#define DOEPINT_OTEPDIS         (1U<<4)     /**< OUT token received when
                                                 endpoint disabled.         */
#define DOEPINT_STUP            (1U<<3)     /**< SETUP phase done.          */
#define DOEPINT_EPDISD          (1U<<1)     /**< Endpoint disabled
                                                 interrupt.                 */
#define DOEPINT_XFRC            (1U<<0)     /**< Transfer completed
                                                 interrupt.                 */
/** @} */

/**
 * @name DOEPTSIZ register bit definitions
 * @{
 */
#define DOEPTSIZ_RXDPID_MASK    (3U<<29)    /**< Received data PID mask.    */
#define DOEPTSIZ_RXDPID(n)      ((n)<<29)   /**< Received data PID value.   */
#define DOEPTSIZ_STUPCNT_MASK   (3U<<29)    /**< SETUP packet count mask.   */
#define DOEPTSIZ_STUPCNT(n)     ((n)<<29)   /**< SETUP packet count value.  */
#define DOEPTSIZ_PKTCNT_MASK    (0x3FFU<<19)/**< Packet count mask.         */
#define DOEPTSIZ_PKTCNT(n)      ((n)<<19)   /**< Packet count value.        */
#define DOEPTSIZ_XFRSIZ_MASK    (0x7FFFFU<<0)/**< Transfer size mask.       */
#define DOEPTSIZ_XFRSIZ(n)      ((n)<<0)    /**< Transfer size value.       */
/** @} */

/**
 * @name PCGCCTL register bit definitions
 * @{
 */
#define PCGCCTL_PHYSUSP         (1U<<4)     /**< PHY Suspended.             */
#define PCGCCTL_GATEHCLK        (1U<<1)     /**< Gate HCLK.                 */
#define PCGCCTL_STPPCLK         (1U<<0)     /**< Stop PCLK.                 */
/** @} */

/**
 * @brief   OTG_FS registers block memory address.
 */
#define OTG_FS_ADDR                 0x50000000

/**
 * @brief   OTG_HS registers block memory address.
 */
#define OTG_HS_ADDR                 0x40040000

/**
 * @brief   Accesses to the OTG_FS registers block.
 */
#define OTG_FS                      ((stm32_otg_t *)OTG_FS_ADDR)

/**
 * @brief   Accesses to the OTG_HS registers block.
 */
#define OTG_HS                      ((stm32_otg_t *)OTG_HS_ADDR)

#endif /* _STM32_OTG_H_ */

/** @} */
